#Книги
books = [
    {
        #Название книги
        "title": "Сильмариллион",
        #Автор книги
        "author": "Джон Толкиен",
        #Год публикации
        "year": 1937
    },
    {
        #Название книги
        "title": "Хоббит",
        #Автор книги 
        "author": "Джон Толкиен",
        #Год публикации
        "year": 1948
    },
    {
        #Название книги
        "title": "Властелин колец: Хранители кольца",
        #Автор книги
        "author": "Джон Толкиен",
        #Год публикации
        "year": 1954
    },
    {
        #Название книги
        "title": "Властелин колец: Две башни",
        #Автор книги
        "author": "Джон Толкиен",
        #Год публикации
        "year": 1954
    },
    {
        #Название книги
        "title": "Властелин колец: Возвращение короля",
        #Автор книги
        "author": "Джон Толкиен",
        #Год публикации
        "year": 1955
    }
]
#Перебор элементов book и иих индексы
for index, book in enumerate(books, start=1):
    #Вывод
    print(f"-------------------- Книга {index} ---------------------")
    print(f"Название: {book['title']}, Автор: {book['author']},")
    print(f"-----------------------{book['year']}-----------------------\n")